wk20/tweeter_app_api/app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
    def index
        tweets = Tweet.all

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Covid19 will destroy the world!"], ["content", "This tweet shows how CV19 is quickly decimating every part of society."], ["author", "The WHO"]]
---
    def create
        tweet = Tweet.new(tweet_params)

        if tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tweets" SET "content" = $1 WHERE "tweets"."id" = $2  [["content", "They are actually walking there"], ["id", 2]]
---
    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 1]]
---
    def destroy
        tweet = Tweet.find(params[:id])
        tweet.destroy()